// Formatting string for metres
"%g m"							= "%.3g m";

// Undo actions
"Reverse Winding"				= "Reverse Winding";
"Recalculate Normals"			= "Recalculate Normals";
"Triangulate"					= "Triangulate";
"Recentre"						= "Recentre";
"Flip X"						= "Flip X";
"Flip Y"						= "Flip Y";
"Flip Z"						= "Flip Z";

// Toolbar items
"Show Inspector"				= "Show Inspector";
"Hide Wireframe"				= "Hide Wireframe";
"Show Wireframe"				= "Show Wireframe";
"Show/Hide Wireframe"			= "Show/Hide Wireframe";
"Hide Faces"					= "Hide Faces";
"Show Faces"					= "Show Faces";
"Show/Hide Faces"				= "Show/Hide Faces";
"Hide Normals"					= "Hide Normals";
"Show Normals"					= "Show Normals";
"Show/Hide Normals"				= "Show/Hide Normals";
"Compare..."					= "Compare…";

// Error strings
"A memory allocation failed." = "A memory allocation failed.";
"No data could be loaded from this location. Please ensure that the file exists." = "No data could be loaded from this location. Please ensure that the file exists.";
"The file appears to be invalid (the NVERTS line isn't where it should be)." = "The document appears to be invalid (the NVERTS line isn’t where it should be).";
"The file appears to be invalid (the NFACES line isn't where it should be)." = "The document appears to be invalid (the NFACES line isn’t where it should be).";
"The file appears to be invalid (couldn't read vertex data)." = "The document appears to be invalid (couldn’t read vertex data).";
"The file appears to be invalid (couldn't read texture data)." = "The document appears to be invalid (couldn’t read texture data).";
"The file contains polygons with more edges than Dry Dock supports." = "The file contains faces with more edges than Dry Dock supports.";
"The document could not be saved, because an error occured when trying to create a triangulated copy." = "The document could not be saved, because an error occured when trying to create a triangulated copy.";

"The texture \"%@\" could not be opened. Additionally, the standard fallback texture could not be loaded. This could be due to a memory shortage. If the problem persists, please submit a bug report." = "The texture “%@” could not be opened. Additionally, the standard fallback texture could not be loaded. This could be due to a memory shortage. If the problem persists, please submit a bug report.";

// "Issue" strings
"A memory allocation failed. This may be due to a memory shortage or a faulty input file." = "A memory allocation failed. This may be due to a memory shortage or a faulty input file.";
"This document contains non-triangular faces. In order to save it in the selected format, Dry Dock will triangulate it." = "This document contains non-triangular faces. In order to save it in the selected format, Dry Dock will triangulate it.";
"This document contains a texture named \"%@\". The specified format does not support texture names containing spaces, commas, line breaks, \"#\" or \"//\"." = "This document contains a texture named “%@”. The specified format does not support texture names containing spaces, commas, line breaks, “#” or “//”.";
"No data could be loaded from %@. %@" = "No data could be loaded from %@.";
"The required NVERTS line could not be found." = "The document appears to be invalid (the NVERTS line isn't where it should be).";
"The required NFACES line could not be found." = "The document appears to be invalid (the NFACES line isn't where it should be).";
"Vertex data could not be read for vertex line %u." = "Vertex data could not be read for vertex line %u.";
"Colour data could not be read for face line %u." = "Colour data could not be read for face line %u.";
"Invalid vertex count (%u) for face line %u. Each face must have at least 3 and no more than %u vertices." = "Invalid vertex count (%u) for face line %u. Each face must have at least three and no more than %u vertices.";
"Vertex data could not be read for face line %u." = "Vertex data could not be read for face line %u.";
"Face line %u specifies a vertex index of %u, but there are only %u vertices in the document." = "Face line %u specifies a vertex index of %u, but there are only %u vertices in the document.";
"Face line %u specifies a U/V index of %u, but there are only %u U/V pairs in the document." = "Face line %u specifies a U/V index of %u, but there are only %u U/V pairs in the document.";
"Face line %u specifies a normal index of %u, but there are only %u normal in the document." = "Face line %u specifies a normal index of %u, but there are only %u normal in the document.";
"Texture name could not be read for face line %u." = "Texture name could not be read for texture line %u.";
"Texture scale could not be read for texture line %u." = "Texture scale could not be read for texture line %u.";
"U/V pair could not be read for texture line %u." = "U/V pair could not be read for texture line %u.";
"No texture named \"%@\" could be found, using fallback texture." = "No texture named “%@” could be found, using fallback texture.";
"The fallback texture could not be loaded. This probably indicates a memory problem." = "The fallback texture could not be loaded. This probably indicates a memory shortage.";
"No texture data could be loaded from %@." = "No texture data could be loaded from %@.";
"The document contains multiple material library references. Currently, only one material library is supported. Ignoring reference to material library \"%@\"." = "The document contains multiple material library references. Currently, only one material library is supported. Ignoring reference to material library “%@”.";
"The document contains lines of unknown type \"%@\", which will be ignored." = "The document contains lines of unknown type “%@”, which will be ignored.";
"The document contains lines of type \"%@\" (%@), which will be ignored." = "The document contains lines of type “%@” (%@), which will be ignored.";
"No material library could be loaded from %@. %@" = "No material library could be loaded from %@.";
"Face line %u specifies an invalid vertex index %@." = "Face line %u specifies an invalid vertex index %@.";
"Face line %u specifies an invalid U/V index %@." = "Face line %u specifies an invalid U/V index %@.";
"Face line %u specifies an invalid normal index %@." = "Face line %u specifies an invalid normal index %@.";
"Some or all faces in the document lack a valid normal specified. This is likely to lead to lighting problems. This issue can be rectified by selecting Recalculate Normals from the Tools menu." = "Some or all faces in the document do not have a valid normal specified. This is likely to lead to lighting problems. This issue can be rectified by selecting Recalculate Normals from the Tools menu.";
"Supressing further warnings about U/V indices." = "Supressing further warnings about U/V indices.";
"Supressing further warnings about normal indices." = "Supressing further warnings about normal indices.";

// Unsupported OBJ line types
"OBJ_LINE vp" = "parameter-space vertex";
"OBJ_LINE deg" = "parametric curve/surface degree";
"OBJ_LINE bmat" = "parametric curve/surface basis matrix";
"OBJ_LINE step" = "parametric curve/surface step size";
"OBJ_LINE cstype" = "parametric curve/surface type";
"OBJ_LINE p" = "point";
"OBJ_LINE l" = "line";
"OBJ_LINE curv" = "curve";
"OBJ_LINE curv2" = "two-dimensional curve";
"OBJ_LINE surf" = "surface";
"OBJ_LINE parm" = "parameter values";
"OBJ_LINE trim" = "outer trimming loop";
"OBJ_LINE hole" = "inner trimming loop";
"OBJ_LINE scrv" = "special curve";
"OBJ_LINE sp" = "special point";
"OBJ_LINE end" = "end statement";
"OBJ_LINE con" = "connection";
"OBJ_LINE s" = "smoothing group";
"OBJ_LINE mg" = "merging group";
"OBJ_LINE bevel" = "bevel interpolation";
"OBJ_LINE c_interp" = "colour interpolation";
"OBJ_LINE d_interp" = "dissolve interpolation";
"OBJ_LINE lod" = "level of detail";
"OBJ_LINE shadow_obj" = "shadow casting";
"OBJ_LINE trace_obj" = "ray tracing";
"OBJ_LINE ctech" = "curve approximation technique";
"OBJ_LINE stech" = "surface approximation technique";

// UKFeedbackProvider stuff
"FEEDBACK_EMAIL" = "UMHMLDIZEYNZ@spammotel.com";
"FEEDBACK_SUBJECT_PREFIX" = "[Dry Dock] ";
"FEEDBACK_URL" = "mailto:UMHMLDIZEYNZ@spammotel.com?subject=[Dry Dock] ";

// Tiger Required alert strings
"Dry Dock requires Mac OS X 10.4 or later." = "Dry Dock for Oolite requires Mac OS X 10.4 or later.";
"Dry Dock uses certain features specific to Mac OS X 10.4. If you feel this is a problem, please e-mail a request that this change." = "Dry Dock uses certain features specific to Mac OS X 10.4. If you feel this is a problem, please e-mail a request that this change.";

// Problem Report Manager strings
"An issue arose while attempting to %@:" = "An issue arose while attempting to %@:";
"Some issues arose while attempting to %@:" = "Some issues arose while attempting to %@:";
"save the document" = "save the document";
"open the document" = "open the document";
"The nature of these issues is such that it is impossible to continue %@." = "The nature of these issues is such that it is impossible to continue %@.";
"Do you wish to continue %@?" = "Do you wish to continue %@?";
"saving" = "saving";
"opening" = "opening";
